[M_Sage_FollowGlow MissionDefinition]
MissionDescription="Claptrap has spotted the skag who peed all over his grove. He wants you to rid Pandora of the skag's urine-soaked evil for good."
TeaserText="...you gotta go."
